# BuiltInFailures.ImageFailures Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ImageFailures Class
BuiltInFailures Class Members See Also
---
Failures about Image.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class ImageFailures
```

Visual Basic
---
```text
Public NotInheritable Class ImageFailures
```

Visual C++
---
```text
public ref class ImageFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..ImageFailures
# See Also
BuiltInFailures..::..ImageFailures Members
Autodesk.Revit.DB Namespace